Revit 2027 API
Document.IsDefaultFamilyTypeIdValid Method
 Checks whether the family type id is valid for the give family category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDefaultFamilyTypeIdValid(
	ElementId familyCategoryId,
	ElementId familyTypeId
)
Public Function IsDefaultFamilyTypeIdValid (
	familyCategoryId As ElementId,
	familyTypeId As ElementId
) As Boolean
public:
bool IsDefaultFamilyTypeIdValid(
	ElementId^ familyCategoryId,
	ElementId^ familyTypeId
)
member IsDefaultFamilyTypeIdValid :
        familyCategoryId : ElementId *
        familyTypeId : ElementId -> bool
Parameters
familyCategoryId ElementId
 The family category id.
familyTypeId ElementId
 The default family type id.
Return Value
Boolean
 True if the family type id is valid for the give family category, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace